API/app/controllers/v1/admin/admin_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."company_uid" = $1 LIMIT $2  [["company_uid", ""], ["LIMIT", 1]]
---
    def document_validity_checker
        road_taxes = []
        insurances = []
        technical_exams = []
        company = Company.find_by(company_uid: params[:company_uid])