API/app/controllers/v1/admin/admin_controller.rb

INSERT INTO "cities" ("city_uid", "name", "zip_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "city_uid"  [["city_uid", "CTY_LG50V"], ["name", "Gyergyóújfalu"], ["zip_code", "535560"], ["created_at", "2023-10-25 16:33:13.502750"], ["updated_at", "2023-10-25 16:33:13.502750"]]
---
    def create_city
        city = City.new
        city.name = params[:name]
        city.zip_code = params[:zip_code]
        city.save
        if(city.save)

INSERT INTO "companies" ("company_uid", "name", "email", "phone_number", "tax_number", "city", "office_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "company_uid"
---
    def create_company
        company = Company.new
        company.name = params[:name]
        company.email = params[:email]
        company.phone_number = params[:phone_number]
        company.tax_number = params[:tax_number]
        company.city = params[:city]
        company.office_address = params[:office_address]
        if(company.save)

SELECT "companies".* FROM "companies" WHERE "companies"."company_uid" = $1 LIMIT $2  [["company_uid", ""], ["LIMIT", 1]]
---
    def create_bus
        bus = Bus.new
        bus.company = Company.find_by(company_uid: params[:company_uid])

INSERT INTO "stations" ("station_uid", "name", "longitude", "latitude", "city_uid", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "station_uid"
SELECT "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Gyergyócsomafalva"], ["LIMIT", 1]]
---
    def create_station
        station = Station.new
        station.name = params[:name]
        station.latitude = params[:latitude]
        station.longitude = params[:longitude]
        station.city = City.find_or_create_by(name: params[:city])