API/app/controllers/v1/application_controller.rb

SELECT "cities".* FROM "cities"
---
   def get_cities
    cities = City.all

SELECT "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Ciumani"], ["LIMIT", 1]]
---
   def get_stations_by_city
    city = City.find_by(name: params[:name])

SELECT "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Ciumani"], ["LIMIT", 1]]
SELECT "stations".* FROM "stations" WHERE "stations"."name" = $1 LIMIT $2  [["name", "Csomafalva központ"], ["LIMIT", 1]]
SELECT "stations".* FROM "stations" WHERE "stations"."station_uid" = $1  [["station_uid", "CTY_D0STL"]]
---
   def get_routes_by_city_and_station
    city = City.find_by(name: params[:city])
    station = Station.find_by(name: params[:station])

    if city && station
      routes = city.routes.includes(:stations).where(stations: { station_uid: station.station_uid })

SELECT "routes".* FROM "routes" WHERE "routes"."name" = $1 LIMIT $2  [["name", "Szászfalu-Gyergyó"], ["LIMIT", 1]]
SELECT "stations".* FROM "stations" WHERE "stations"."name" = $1 LIMIT $2  [["name", "Gyergyó Maros hotel"], ["LIMIT", 1]]
SELECT "routes".* FROM "routes"
SELECT 1 AS one FROM "route_stations" WHERE "route_stations"."route_uid" = $1 AND "route_stations"."station_uid" = $2 LIMIT $3  [["route_uid", "ROU_V0X2Z"], ["station_uid", "STT_GJWT0"], ["LIMIT", 1]]
SELECT "route_stations"."departure_time" FROM "route_stations" WHERE "route_stations"."route_uid" = $1 AND "route_stations"."station_uid" = $2  [["route_uid", "ROU_V0X2Z"], ["station_uid", "STT_GJWT0"]]
---
  def get_departure_times_for_station_in_route
    route = Route.find_by(name: params[:route])
    station = Station.find_by(name: params[:station])

    if route && station
      route_stations = RouteStation.where(route_uid: route.route_uid, station_uid: station.station_uid)

      if route_stations.any?
        departure_times = route_stations.pluck(:departure_time)