API/app/controllers/v1/application_controller.rb

  def get_stations_by_city
    city = City.find_by(city_uid: params[:city_uid])
    if city
      new_data = []
      stations = city.stations.map do |station|
---
SELECT "stations".* FROM "stations" WHERE "stations"."city_uid" = $1  [["city_uid", "CTY_D0STL"]]